# ZoomToFit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..ZoomToFit Method
UIView Class See Also
---
Zoom the view to fit its contents.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ZoomToFit()
```

Visual Basic
---
```text
Public Sub ZoomToFit
```

Visual C++
---
```text
public:
void ZoomToFit()
```

# See Also
UIView Class
Autodesk.Revit.UI Namespace